{
    "version": "https://jsonfeed.org/version/1",
    "title": "Sammykins",
    "description": "",
    "home_page_url": "https://blog.sammykins.au",
    "feed_url": "https://blog.sammykins.au/feed.json",
    "user_comment": "",
    "icon": "https://blog.sammykins.au/media/website/26049947.png",
    "author": {
        "name": "Samantha"
    },
    "items": [
        {
            "id": "https://blog.sammykins.au/posts/review-meta-ray-bans-headliner/",
            "url": "https://blog.sammykins.au/posts/review-meta-ray-bans-headliner/",
            "title": "Review: Meta Ray Bans Headliner",
            "summary": "<h1>Why am I doing this to myself 🤔</h1>\n<p class=\"msg--info msg\"><strong>EDITORS NOTE: </strong> I will preface that my intent is to return to the OPSM I purchased these from for remediation of some issues which don't necessarily relate to the frames themselves, which I may bring up in this week-long impressions of the glasses. There may be a follow-up review of OPSM's customer service at a later time.</p>\n<p>Honestly? The primary reasoning is that I have longed for a device that can put a camera, microphone and speakers onto my head in the same way that Google Glass once did—just in this case without a display (we're not there yet..)</p>\n<p class=\"align-left\">The biggest issue going into this was the cost which I've got below from a snippet of the invoice from OPSM for my pair, which are intended for me to wear throughout the day as a replacement for regular glasses and sunglasses, more on that bit later, so for me the investment seemed <em>kinda</em> worth it.</p>\n",
            "content_html": "<h1>Why am I doing this to myself 🤔</h1>\n<p class=\"msg--info msg\"><strong>EDITORS NOTE: </strong> I will preface that my intent is to return to the OPSM I purchased these from for remediation of some issues which don't necessarily relate to the frames themselves, which I may bring up in this week-long impressions of the glasses. There may be a follow-up review of OPSM's customer service at a later time.</p>\n<p>Honestly? The primary reasoning is that I have longed for a device that can put a camera, microphone and speakers onto my head in the same way that Google Glass once did—just in this case without a display (we're not there yet..)</p>\n<p class=\"align-left\">The biggest issue going into this was the cost which I've got below from a snippet of the invoice from OPSM for my pair, which are intended for me to wear throughout the day as a replacement for regular glasses and sunglasses, more on that bit later, so for me the investment seemed <em>kinda</em> worth it.</p>\n\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/CleanShot-2025-01-20-at-20.56.01.png\" data-size=\"578x367\"><img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/CleanShot-2025-01-20-at-20.56.01-thumbnail.png\" alt=\"\" width=\"289\" height=\"183\"></a>\n<figcaption>Who pays over $1000 for a single pair of glasses? This goober.</figcaption>\n</figure>\n</div></div>\n<p>I'm holding out for the day we finally see mainstream adoption of devices like this with all-day battery life like our smartwatches have received as they evolve and shrink down, the Meta Ray Bans could be worse. So lets just burn a week on adapting to how these adapt into my day-to-day life.</p>\n<p>At the end of the day, if someone at Meta happens to come across this post, feel free to reach out because I have notes as a long-time smart head-mounted-thing person. There's a lot of my thoughts spun into this review which would probably be useful to whoever is running this program because I want them to succeed.</p>\n<h1>Pickup day and initial impressions 💰</h1>\n<div style=\"display: flex; justify-content: center; align-items: center; height: 35vh;\">\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Day zero with <a href=\"https://twitter.com/Meta?ref_src=twsrc%5Etfw\">@Meta</a> Ray Bans, a 🧵<br><br>- The AI assistant is actually dumb, can't send last photo to group Messenger chat, only contacts?<br>- Need first party clip-on sunglasses for clear lense users, transitions are weak in cars<br>- Need first party dock/charging stand ASAP</p>\n— sammykins (@thesammykins) <a href=\"https://twitter.com/thesammykins/status/1881132748875956247?ref_src=twsrc%5Etfw\"> January 20, 2025 </a></blockquote>\n<script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</div>\n<p>I posted on my Twitter (<em>sorry never calling it X</em>) a thread of the things I found most needed in the future, alongside some things I'd love to see. As an excuse to drive you over to my ramblings there I'll not be adding anything else for Day Zero here so for my initial impressions and complaints go there and come back for the fun of Day One jumping out there.</p>\n<p>The one thing I will comment on is that the unboxing experience in-store was amusing, the OPSM salesperson said they weren't allowed to touch them at all and I had to manage the entire unboxing myself, I expect because me opening them makes me liable for any problems they have.</p>\n<h1>Day One: So these are gonna be a pain 🤺</h1>\n<p>Where do I honestly begin? I went into my first actual day of wearing these with the expectation that I would begin to find them more comfortable, in fact what I discovered is that I still have a lot of adapting to do with them.</p>\n<p>I should provide a little more context for <strong>why</strong> I'm struggling to come to terms with their density, or as some could put it more simply, their weight. For wearables on my head have been a thing for a long time, I started out with head-mounted wearables when I built my first wearable computer, <a href=\"https://forums.overclockers.com.au/threads/flass-my-google-glass.1074078/\" target=\"_blank\" rel=\"noopener noreferrer\">Flass</a> (<em>left</em>). Then onto a Google Glass (<em>middle</em>) and finally with my Meta Ray Bans (<em>right</em>)</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/DSC_0084.jpg\" data-size=\"832x887\"> <img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/DSC_0084-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"819\"> </a>\n<figcaption>Flass, my first custom wearable computer</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/IMG_20140402_114013.jpg\" data-size=\"894x1589\"> <img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/IMG_20140402_114013-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"1365\"> </a>\n<figcaption>Google Glass, a smart computer and camera</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/IMG-0836-Preview-from-Immich.jpeg\" data-size=\"1440x1920\"> <img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/IMG-0836-Preview-from-Immich-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"1024\"> </a>\n<figcaption>Meta Ray Bans, a dumb camera wearable</figcaption>\n</figure>\n</div></div>\n<p>For me a wearable device on your face should feel like you're wearing normal glasses, following what I consider to be a basic guidance of principles to what these devices should achieve below, I'll explicitly point out where the Meta Ray Bans have failed to match these requirements as we go through them.</p>\n<blockquote>\n<h6>The device should not cause pain whilst sitting on the users ears.</h6>\n<p class=\"msg msg--info\">The Meta Ray Bans, in my Headliner variation are not comfortable on the ears as all. They don't distribute the weight very well and feel incredibly heavy on the tops of my ears. Now I won't count this as a massive dealbreaker because eventually my ears will adjust to this as they always have, but it's a consideration if you have a sensitivity to this.</p>\n<h6>The device should not cause pain when using the users nose bridge.</h6>\n<p class=\"msg msg--info\">The Meta Ray Bans definitely don't sit nicely on the nose bridge for me, they feel unbalanced and like they are sitting too low on my face on an angle. This may be due to there being two variants of the Headliner, a low bridge and a standard bridge. I expect that I'll eventually adapt to it but the Ray Bans should be redesigned on the nose bridge to not have such harsh surfaces for daily use.</p>\n<h6>The device should augment aspects of the users vision and hearing.</h6>\n<p class=\"msg msg--info\">This device augments both of these in a way which I would not define as being 'smart' as the Meta Ray Bans are a Bluetooth headset with a camera. They give the user the ability to snap a 'moment' which augments our memory of events and the hearing is augmented in the sense they allow you to take phone calls or listen to music without needing to wear earbuds and not exclude outside sounds.</p>\n<h6>The device should lend itself to being wearable for at minimum, 8 hours at a time.</h6>\n<p class=\"msg msg--info\">After using the Meta Ray Bans throughout the day I can conclusively say they do not meet this requirement and the charging options by first-party are lacking in the sense the only way to charge these without using a third-party solution is with the included Charging Case. There is no approved accessory for charging at a nightstand or desk during the day.</p>\n</blockquote>\n<p>So where does that leave us after day one? Well the above outlines the few issues I have with it at the moment as we move towards day two. What I am starting to notice is that overall my prescription that was put into these glasses may be a little extreme which isn't great, so I'll likely be giving my eyes another couple of days to adjust before I head back to OPSM to find out what they can do.</p>\n<h1>Day Two: Maybe I am adjusting? 💪🏻</h1>\n<p>So these things are starting to grow on me in a few ways, not sure if all the production oils or something is wearing off which was causing them to slide off my nose but they seem to be staying up on my eyeballs a lot nicer than during previous days.</p>\n<p>I'm beginning to notice how slow and ineffective the transition lens are when going outdoors. I'm still squinting which is making me just want to jump into Firmoo or Zenni and use this new prescription on seperate sunglasses.. but then where so I constantly store my day-to-day glasses which are these Meta Ray Bans?</p>\n<p>This is a reason why I'd love to see some more first party solutions to this rather than relying entirely on Transition lenss.. Meta.. I doubt you're listening but next time offer three options with your glasses:</p>\n<ul>\n<li>A variant with clear lens</li>\n<li>A variant with sunglass lens</li>\n<li>A variant with transition lens</li>\n<li>A seperate clip-on polarised sunglass attachment, this specifically will benefit those of us buying these with prescription lens.</li>\n</ul>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/IMG_0860.jpeg\" data-size=\"3088x2316\"> <img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/IMG_0860-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"576\"> </a>\n<figcaption>Taking them outside and putting them in direct sunlight, notice how I still have to squint..</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/IMG_0862.jpeg\" data-size=\"3088x2316\"> <img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/IMG_0862-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"576\"> </a>\n<figcaption>Coming inside the transitions do start to fade away within a minute</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/IMG_0863.jpeg\" data-size=\"3088x2316\"> <img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/IMG_0863-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"576\"> </a>\n<figcaption>After two minutes they're basically back to normal</figcaption>\n</figure>\n</div></div>\n<p>I won't promise that I'll get around to engineering myself some clip-on/slide on sunglasses with a pair of polarised sunnies I got off Amazon that match the style but it's something I've been working on today that I hope to release soon. There are third-party solutions out there on <a href=\"https://aliexpress.com/item/1005008277814438.html?algo_pvid=3b346834-bf18-4d80-9c74-854ba4850560&amp;algo_exp_id=3b346834-bf18-4d80-9c74-854ba4850560-1&amp;pdp_npi=4@dis!AUD!16.79!16.79!!!10.39!10.39!@2101c5a417379447980606475ee392!12000044459981080!sea!AU!852873412!X&amp;curPageLogUid=GQ7sFWlqrBSz&amp;utparam-url=scene:search%7Cquery_from:\" target=\"_blank\" rel=\"noopener noreferrer\">AliExpress for the Wayfarer variant</a> of the glasses which is good to see.</p>\n<p>I've found the battery life to be rather good today but I have not taken many photos, video or played music through them so it's interesting to see how the battery drains naturally throughout the day. I expect once I tune some notification announcements that I want to have come through the glasses that there will be an improvement.</p>\n<p>Overall day two is the first day that I haven't 'noticed' the glasses much and started to explore a few core flaws with the purchase, I'm not regretting it but I am starting to understand these weren't worth the cost in total without thinking about the additional things I'll need to buy or design myself to resolve easily fixable problems.</p>\n<h1>Day Three: Finding use cases 👀</h1>\n<p>Over the past few days I've found myself mainly just using the Meta Ray Bans for their intended use pretty sporadically, once you disable the ability to activate Meta AI by saying \"Hey Meta\" you lose all of your hands free functionality at the expense of battery life, which is the downside to not having multiple charging solutions.</p>\n<p>I've made the single hold gesture on the right-hand side get Meta AI listening to me but definitely better when you can just speak and ask it to do things. Which leads me into the next question.. can Meta actually improve the software on these enough to resolve battery drain issues? I doubt it, but it depends if they intend to roll-out new features to these in the long term and not replace them with more advanced models.</p>\n<p>What we see on the horizon with the Meta Live AI feature, currently being tested in the US region, must be a substantial drain on the battery when I consider what just playing music does to the percentage. Would be nice if they had a form of battery chart to plot how the battery is travelling throughout the day. The Meta View app itself has very minimal impact on the iPhone battery itself which is a nice plus.</p>\n<p>The pain I've had on my ear from how tight the frames are on my head hasn't passed yet which is a touch annoying. I'd like if these had some adjustment that didn't void the warranty, they need just a slight tweaking to them in order to have a perfect fit and not cause me anymore problems. Over time I expect they will naturally stretch and I'm just being a touch facetious.</p>\n<p>I'm taking more opportunity for photos and I've got a couple of examples below of some video and static shots I've taken over the last few days in various lighting conditions, these are definitely not low-light cameras so don't go taking them into situations where there's not a lot of light.</p>\n<p class=\"msg msg--highlight\">I took the comparison photos below attempting to keep the same composing shot between my Meta Ray Bans and the iPhone 16 Pro, giving the Meta Ray Bans the best opportunity to shine with direct sunlight.</p>\n<div class=\"gallery-wrapper gallery-wrapper--wide\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/Ray-Bans-1.jpeg\" data-size=\"3024x4032\"><img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/Ray-Bans-1-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"1024\"></a>\n<figcaption>Meta Ray Bans - image of tree</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/iPhone-16-Pro-1.jpeg\" data-size=\"5712x4284\"><img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/iPhone-16-Pro-1-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>iPhone 16 Pro - image of tree</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/Ray-Bans-3.jpeg\" data-size=\"3024x4032\"><img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/Ray-Bans-3-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"1024\"></a>\n<figcaption>Meta Ray Bans - image of closet</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/iPhone-16-Pro-3.jpeg\" data-size=\"5712x4284\"><img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/iPhone-16-Pro-3-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>iPhone 16 Pro - image of closet, no low-light mode enabled</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/Ray-Bans-2.jpeg\" data-size=\"3024x4032\"><img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/Ray-Bans-2-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"1024\"></a>\n<figcaption>Meta Ray Bans - image of car</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.sammykins.au/media/posts/4/gallery/iPhone-16-Pro-2.jpeg\" data-size=\"5712x4284\"><img loading=\"lazy\" src=\"https://blog.sammykins.au/media/posts/4/gallery/iPhone-16-Pro-2-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>iPhone 16 Pro - image of car</figcaption>\n</figure>\n</div></div>\n<h1>Day Four: Feeling like it was a mistake 🥴</h1>\n<p>I've still got the pain on the top of my ears where the glasses are very nicely clamping into my head, I feel as though Meta or Ray Ban need to think about designing their glasses for adjustment, especially if they intend these to be widely used by people.</p>\n<p>At the moment they just don't feel \"normal comfortable\", they are heavy on my nose bridge, clamping my head and overall don't blend into just sitting on my face. Add to that the little \"RB\" logo etched into the lens that I can see in the corner of my eye and generally it's not a comfortable daily-wear glasses experience.</p>\n<p>I've come to the conclusion these are an \"hour-at-a-time\" device, not intended for wearing all day based on the charging cycles and general lack of adjustability. I would highly recommend that anyone intending to buy these does so at a location that accepts returns, the demo units in the store <strong>do not</strong> replicate the full experience as they don't weigh the same as proper retail units.</p>\n<p>It's ironic that the day I'm writing this, Meta are planning to release their Super Bowl commercial starring Chris Pratt and Chris Hemsworth to sell more of these devices, albeit focusing on the Wayfarer variant which seems to be selling more. There's a lot to learn by Meta from the average consumer who is actually wanting to use something like this not as a toy, but as a daily tool to enhance their day-to-day like myself.</p>\n<p>What I'm beginning to see now, being just over four days into wearing the Meta Ray Bans as my regular glasses (<em>for at minimum 10 hours a day</em>) is that I am feeling like I may have made a mistake spending over $1000 Australian Dollars on these glasses. Whilst I could blame the misleading demo unit in the store for being 'comfortable' to me for the 10-15 minutes I wore them to really see if they would fit well, I think the underlying lack of fit-for-all is a detriment to these being truly fantastic glasses.</p>\n<h1>Day Five: They've won me over, for now 🥽</h1>\n<p>Look if you've made it this far through my ramblings about these glasses, then you're clearly here to find out why I'm keeping these and not going to the trouble of trying to return them. I've come to terms with what is limiting and what is fantastic about them, that's ultimately the crux of it for me.</p>\n<p>I'll break down some of the things I've ended up loving and then the things I've ended up disliking about them, not hating but simply disliking:</p>\n<h6>Things I love ❤️</h6>\n<ul>\n<li>It's incredibly convenient not needing to have earbuds in to take a call, listen to some music and get notifications read out to me. It's also rather nice to use it for music at my Mac desktop setup so I'm not blasting speakers when my boyfriend is doing things in another room and I'm too lazy to grab my headphones.\n<ul>\n<li><strong>NOTE:</strong> The notifications stuff is iffy-iffy on iOS because I wear an Apple Watch and it takes priority over reading me out notifications.. I should fix that..</li>\n</ul>\n</li>\n<li>Being able to quickly snap a photo or take a video is super nice to me, it's the aspect I loved the most about Google Glass, even if Glass did frame photos far better, what I was looking at was captured vs with the Meta Ray Bans being slightly off centre.</li>\n<li>Simple voice commands for setting reminders and timers are super useful, sure I could ask Siri or set up something on a Nest Hub around the home but for some reason I found it super convenient to just use the glasses to do it.</li>\n<li>What Meta and Ray Ban have accomplished with these glasses is impressive at the end of the day and I commend them for their efforts in getting this out to market.</li>\n</ul>\n<h6>Things I dislike 👎🏻</h6>\n<ul>\n<li>Meta AI feels really limited, I can ask it to snap a photo and provide it with a question about something but end up with a result that just tells me what it's looking at. Look at the competition in this space and open some doors for the model.\n<ul>\n<li><em>For example</em>, I wanted to adjust my gas ducted heating vents, so I asked it how I could do that and instead got an answer about how it can't answer it for safety reasons? I asked Perplexity on my iPhone and got the answer I wanted.</li>\n</ul>\n</li>\n<li>The comfort adjustment period wasn't great and coming into day five wearing these all day I think my face has begun to properly adjust to them. The primary issue I have had was all the sharp surfaces from where the mould lines are, Ray Ban need to do a lot better on the quality control of these in this regard and it's such a simple little thing to resolve. Especially when you have sharp lines rubbing against your ears all day.</li>\n<li>The lack of first party accessories, where are the desk docks? Where are clip-on polarised lens? The bridge charging concept is clearly a winner and suits glasses, why is there no universal adapter for all of the Meta Ray Ban lineup to charge these at a desk? Is the intention not for buyers to wear these as daily glasses and treat them like sunglasses?</li>\n</ul>\n<h1>So where do we go from here 🤝🏻</h1>\n<p>I'm committed, I'd love to see Meta and Ray Ban expand the partnership into more accessories, maintain a steady flow of software updates and not just abandon the platform after 12 months. The ironic timing of this review when they are due to air a commercial during the Super Bowl implies they are committed to these hardware choice.</p>\n<p>My hope is that Meta expands their User Testing outside of the US and invites keen parties in other countries to help build out what they're doing in the Meta AI space, it's lacking a lot of functionality that other apps are able to service which needs some more engineering time in the oven to get <em>just right</em> and I'm hopeful of future improvement in this space.</p>\n<p>On another front I'm keen for Meta to look into how to resolve the photo-taking situation where it's rough to line up a forward facing shot that actually looks good, tilting your head slightly sideways to ensure you're getting a good, high resolution photo is.. tragic.</p>\n<p>After burning $1080AUD on a pair of these in prescription lens, I'm well and truly on the bandwagon, even if you don't agree with what Meta does as a company or want to buy glasses from a monolithic glasses and lens manufacturer behind Ray Ban, this commitment to these glasses should tell you the direction this technology is heading in and I love it.</p>\n<p>- Signing off until next time 👋🏻</p>",
            "image": "https://blog.sammykins.au/media/posts/4/IMG_0928.jpeg",
            "author": {
                "name": "Samantha"
            },
            "tags": [
                   "technology",
                   "review",
                   "meta",
                   "impression"
            ],
            "date_published": "2025-01-20T20:59:46+11:00",
            "date_modified": "2025-01-27T13:51:14+11:00"
        },
        {
            "id": "https://blog.sammykins.au/posts/hello/",
            "url": "https://blog.sammykins.au/posts/hello/",
            "title": "Hello.",
            "summary": "Hello world. That's what they say right?",
            "content_html": "<p>Hello world. That's what they say right?</p>",
            "author": {
                "name": "Samantha"
            },
            "tags": [
            ],
            "date_published": "2025-01-17T11:21:56+11:00",
            "date_modified": "2025-01-17T11:55:22+11:00"
        }
    ]
}
